IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_SDFM0_CONTROLSS_SDFM0.xml
	<register id="CONTROLSS_SDFM0_SDCTL" acronym="CONTROLSS_SDFM0_SDCTL" offset="0x8" width="16" description="">
		<bitfield id="MIE" width="1" begin="13" end="13" resetval="0x0" description="Master SDy_ERR interrupt enable  0: SDy_ERR Interrupt and interrupt flags are disabled  1: SDy_ERR Interrupt and interrupt flags are enabled" range="13" rwaccess="RW"/> 
		<bitfield id="HZ4" width="1" begin="3" end="3" resetval="0x0" description="Flag Clear bit for HZ4" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HZ3" width="1" begin="2" end="2" resetval="0x0" description="Flag Clear bit for HZ3" range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HZ2" width="1" begin="1" end="1" resetval="0x0" description="Flag Clear bit for HZ2" range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HZ1" width="1" begin="0" end="0" resetval="0x0" description="Flag Clear bit for HZ1" range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDMFILEN" acronym="CONTROLSS_SDFM0_SDMFILEN" offset="0xC" width="16" description="">
		<bitfield id="MFE" width="1" begin="11" end="11" resetval="0x0" description="Master Filter Enable  0: All the four data filter units of SDFM module are disabled. All FIFOs      are cleared  1: Data filter units can be enabled if bit FEN is '1'." range="11" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDSTATUS" acronym="CONTROLSS_SDFM0_SDSTATUS" offset="0xE" width="16" description="">
		<bitfield id="HZ4" width="1" begin="3" end="3" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch4  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ4.HLTZ  1: Comparator filter output '=  SDCMPHZ4.HLTZ" range="3" rwaccess="RO"/> 
		<bitfield id="HZ3" width="1" begin="2" end="2" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch3  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ3.HLTZ  1: Comparator filter output '=  SDCMPHZ3.HLTZ" range="2" rwaccess="RO"/> 
		<bitfield id="HZ2" width="1" begin="1" end="1" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch2  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ2.HLTZ  1: Comparator filter output '=  SDCMPHZ2.HLTZ" range="1" rwaccess="RO"/> 
		<bitfield id="HZ1" width="1" begin="0" end="0" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch1  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ1.HLTZ  1: Comparator filter output '=  SDCMPHZ1.HLTZ" range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCTLPARM1" acronym="CONTROLSS_SDFM0_SDCTLPARM1" offset="0x20" width="16" description="">
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1: SD Data is passed through a synchronizer." range="6" rwaccess="RW"/> 
		<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1: SD Clock is passed through a synchronizer." range="4" rwaccess="RW"/> 
		<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD1 Clock source select. 0: Clock source to SDFM filter is its channel clock. 1: Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="RW"/> 
		<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0: Mode 0: Modulator clock running at 1x data rate 1: Reserved 2: Reserved 3: Reserved" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDDFPARM1" acronym="CONTROLSS_SDFM0_SDDFPARM1" offset="0x22" width="16" description="">
		<bitfield id="SDSYNCEN" width="1" begin="12" end="12" resetval="0x0" description="PWM synchronization (SDSYNC) of data filter  0: PWM synchronization  of data filter is disabled  1: PWM synchronization of data filter is enabled  Note: SDSYNCx.SYNCSEL bits define which PWM signal is used to              synchronize PWMs" range="12" rwaccess="RW"/> 
		<bitfield id="SST" width="2" begin="11" end="10" resetval="0x0" description="Data filter structure  00: Data filter runs with a Sincfast structure 01: Data filter runs with a Sinc1 structure 10: Data filter runs with a Sinc2 structure 11: Data filter runs with a Sinc3 structure" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="AE" width="1" begin="9" end="9" resetval="0x0" description="Data filter Acknowledge Enable  0: Acknowledge flag is disabled for the particular filter  1: Acknowledge flag is enabled for the particular filter" range="9" rwaccess="RW"/> 
		<bitfield id="FEN" width="1" begin="8" end="8" resetval="0x0" description="Filter Enable  0:  The data filter is disabled and no data is produced  1:  The data filter is enabled and data are produced in the data filter  Note: When filter is disabled, DOSR counter held in reset, filter data          erased. Also resets FIFO pointers and clears the FIFO" range="8" rwaccess="RW"/> 
		<bitfield id="DOSR" width="8" begin="7" end="0" resetval="0x0" description="Data filter Oversampling ratio  The actual oversampling ratio of data filter is DOSR + 1  These bits set the oversampling ratio of the data filter. 0x0FF represents an oversampling ratio of 256." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDDPARM1" acronym="CONTROLSS_SDFM0_SDDPARM1" offset="0x24" width="16" description="">
		<bitfield id="SH" width="5" begin="15" end="11" resetval="0x0" description="Shift Control These bits indicate by how many bits the 16-bit window is shifted up when 16-bit data representation is chosen." range="15 - 11" rwaccess="RW"/> 
		<bitfield id="DR" width="1" begin="10" end="10" resetval="0x0" description="Data filter Data representation  0: Data stored in 16b 2's complement  1: Data stored in 32b 2's complement" range="10" rwaccess="RW"/>
	</register>
