IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_SDFM0_CONTROLSS_SDFM0.xml
	<register id="CONTROLSS_SDFM0_SDFLT3CMPL1" acronym="CONTROLSS_SDFM0_SDFLT3CMPL1" offset="0x68" width="16" description="">
		<bitfield id="LLT" width="15" begin="14" end="0" resetval="0x0" description="Unsigned low-level threshold for the comparator filter output." range="14 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCPARM3" acronym="CONTROLSS_SDFM0_SDCPARM3" offset="0x6A" width="16" description="">
		<bitfield id="CEVT2SEL" width="2" begin="15" end="14" resetval="0x0" description="Comparator Event2 Select 00:  COMPL1 01: COMPL1 OR COMPH1 10: COMPL2 11: COMPL2 OR COMPH2" range="15 - 14" rwaccess="RW"/> 
		<bitfield id="CEN" width="1" begin="13" end="13" resetval="0x0" description="Comparator Filter enable  0: Disable comparator filter  1: Enable comparator filter" range="13" rwaccess="RW"/> 
		<bitfield id="CEVT1SEL" width="2" begin="12" end="11" resetval="0x0" description="Comparator Event1 Select 00:  COMPH1 01: COMPL1 OR COMPH1 10: COMPH2 11: COMPL2 OR COMPH2" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="HZEN" width="1" begin="10" end="10" resetval="0x0" description="High level (Z) Threshold crossing output enable  0: Disable Higher level Threshold (Z) crossing  1: Enable Higher level Threhold (Z) crossing" range="10" rwaccess="RW"/> 
		<bitfield id="MFIE" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure Interrupt Enable  0: Disable modulator failure interrupt and its flag  1: Enable modulator failure interrupt and its flag" range="9" rwaccess="RW"/> 
		<bitfield id="CS1_CS0" width="2" begin="8" end="7" resetval="0x0" description="Comparator filter structure  00: Comparator filter runs with a sincfast structure 01: Comparator filter runs with a Sinc1 structure 10: Comparator filter runs with a Sinc2 structure 11: Comparator filter runs with a Sinc3 structure" range="8 - 7" rwaccess="RW"/> 
		<bitfield id="EN_CEVT2" width="1" begin="6" end="6" resetval="0x0" description="CEVT2 interrupt enable  0: Disable CEVT2 interrupt  1: Enable CEVT2 interrupt" range="6" rwaccess="RW"/> 
		<bitfield id="EN_CEVT1" width="1" begin="5" end="5" resetval="0x0" description="CEVT1 interrupt enable  0: Disable CEVT1 interrupt  1: Enable CEVT1 interrupt" range="5" rwaccess="RW"/> 
		<bitfield id="COSR" width="5" begin="4" end="0" resetval="0x0" description="Comparator Oversampling ratio.   The actual rate is COSR + 1. These bits set the oversampling ratio of the filter. 0x1F represents an oversampling ratio of 32" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDDATA3" acronym="CONTROLSS_SDFM0_SDDATA3" offset="0x6C" width="32" description="">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order 16b in 32b mode, 16-bit Data in 16b mode" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order 16b in 32b mode" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDDATFIFO3" acronym="CONTROLSS_SDFM0_SDDATFIFO3" offset="0x70" width="32" description="">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order 16b in 32b mode, 16-bit Data in 16b mode" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order 16b in 32b mode" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCDATA3" acronym="CONTROLSS_SDFM0_SDCDATA3" offset="0x74" width="16" description="">
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Comparator Data output - 16b only" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDFLT3CMPH2" acronym="CONTROLSS_SDFM0_SDFLT3CMPH2" offset="0x76" width="16" description="">
		<bitfield id="HLT2" width="15" begin="14" end="0" resetval="0x32767" description="Second Unsigned high-level threshold for the comparator filter output." range="14 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDFLT3CMPHZ" acronym="CONTROLSS_SDFM0_SDFLT3CMPHZ" offset="0x78" width="16" description="">
		<bitfield id="HLTZ" width="15" begin="14" end="0" resetval="0x0" description="Unsigned High-level threshold (Z) for the comparator filter output  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator SDCMPHx, it does not have the ability to generate an interrupt." range="14 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDFIFOCTL3" acronym="CONTROLSS_SDFM0_SDFIFOCTL3" offset="0x7A" width="16" description="">
		<bitfield id="OVFIEN" width="1" begin="15" end="15" resetval="0x0" description="SDFIFO Overflow interrupt enable  0: SDFIFO Overflow condition will not generate an interrupt  1: SDFIFO overflow condition generates an interrupt on SDy_ERR" range="15" rwaccess="RW"/> 
		<bitfield id="DRINTSEL" width="1" begin="14" end="14" resetval="0x0" description="Data-Ready Interrupt (DRINT) source select  0 = AF1          (Select non-FIFO data-ready interrupt)  1 = SDFFINT1 (Select FIFO data-ready interrupt)" range="14" rwaccess="RW"/> 
		<bitfield id="FFEN" width="1" begin="13" end="13" resetval="0x0" description="SDFIFO Enable  0:  Disable FIFO operation 1:  Enable FIFO operation  Note: When FIFO is disabled, FIFO contents are cleared" range="13" rwaccess="RW"/> 
		<bitfield id="FFIEN" width="1" begin="12" end="12" resetval="0x0" description="SDFIFO data ready Interrupt Enable" range="12" rwaccess="RW"/> 
		<bitfield id="SDFFST" width="5" begin="10" end="6" resetval="0x0" description="SDFIFO Status  00000 FIFO empty 00001 FIFO has 1 word  . . . . 10000 FIFO has 16 words" range="10 - 6" rwaccess="RO"/> 
		<bitfield id="SDFFIL" width="5" begin="4" end="0" resetval="0x0" description="SDFIFO interrupt level bits   The FIFO will generate an interrupt when the FIFO status (SDFFST) '= FIFO level (SDFFIL )" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDSYNC3" acronym="CONTROLSS_SDFM0_SDSYNC3" offset="0x7C" width="16" description="">
		<bitfield id="WTSCLREN" width="1" begin="10" end="10" resetval="0x1" description="WTSYNFLG Clear-on-FIFOINT Enable  0: WTSYNFLG can only be cleared manually (using WTSYNCLR bit)  1: WTSYNFLG is cleared automatically on SDFFINT" range="10" rwaccess="RW"/> 
		<bitfield id="FFSYNCCLREN" width="1" begin="9" end="9" resetval="0x0" description="FIFO Clear-on-SDSYNC Enable  0: SDFIFO is not automaticaly cleared upon receiving SDSYNC   1: SDFIFO is automaticaly cleared upon receiving SDSYNC" range="9" rwaccess="RW"/> 
		<bitfield id="WTSYNCLR" width="1" begin="8" end="8" resetval="0x0" description="Wait-for-Sync Flag Clear (always reads 0)  0: Write of 0 has no affect  1: Write of 1 clears WTSYNFLG" range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="WTSYNFLG" width="1" begin="7" end="7" resetval="0x0" description="Wait-for-Sync Flag  0: SDSYNC event has not occurred  1: SDSYNC event occurred." range="7" rwaccess="RO"/> 
		<bitfield id="WTSYNCEN" width="1" begin="6" end="6" resetval="0x0" description="Wait-for-Sync Enable  0: Incoming Data written to SDFIFO on every Data-Ready (DR) Event  1: Incoming Data written to SDFIFO on DR event only after SDSYNC event occurs" range="6" rwaccess="RW"/> 
		<bitfield id="SYNCSEL" width="6" begin="5" end="0" resetval="0x0" description="Defines source for the SDSYNC Input on this channel  Refer SDSYNCx.SYNCSEL table" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDFLT3CMPL2" acronym="CONTROLSS_SDFM0_SDFLT3CMPL2" offset="0x7E" width="16" description="">
		<bitfield id="LLT2" width="15" begin="14" end="0" resetval="0x0" description="Second Unsigned low-level threshold for the comparator filter output." range="14 - 0" rwaccess="RW"/>
	</register>
