IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_SDFM0_CONTROLSS_SDFM0.xml
	<register id="CONTROLSS_SDFM0_SDCOMP2EVT2FLTCLKCTL" acronym="CONTROLSS_SDFM0_SDCOMP2EVT2FLTCLKCTL" offset="0xD4" width="16" description="">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP2EVT1FLTCTL" acronym="CONTROLSS_SDFM0_SDCOMP2EVT1FLTCTL" offset="0xD6" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP2EVT1FLTCLKCTL" acronym="CONTROLSS_SDFM0_SDCOMP2EVT1FLTCLKCTL" offset="0xD8" width="16" description="">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP2LOCK" acronym="CONTROLSS_SDFM0_SDCOMP2LOCK" offset="0xDE" width="16" description="">
		<bitfield id="COMP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the SDCOMP2EVT1/2FLTTCTL and COMP2FILCLKCTL registers.    0  SDCOMP2EVT1/2FLTCTL and SDCOMP2EVT1/2FLTCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  SDCOMP2EVT1/2FLTCTL and SDCOMP2EVT1/2FLTCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="SDCOMP2CTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the SDCOMP2CTL register.    0  SDCOMP2CTL register is not locked. Write 0 to this bit has no effect.   1  SDCOMP2CTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="RW
	  			 SONCE"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP3CTL" acronym="CONTROLSS_SDFM0_SDCOMP3CTL" offset="0xE0" width="16" description="">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3 - 2" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP3EVT2FLTCTL" acronym="CONTROLSS_SDFM0_SDCOMP3EVT2FLTCTL" offset="0xE2" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP3EVT2FLTCLKCTL" acronym="CONTROLSS_SDFM0_SDCOMP3EVT2FLTCLKCTL" offset="0xE4" width="16" description="">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP3EVT1FLTCTL" acronym="CONTROLSS_SDFM0_SDCOMP3EVT1FLTCTL" offset="0xE6" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP3EVT1FLTCLKCTL" acronym="CONTROLSS_SDFM0_SDCOMP3EVT1FLTCLKCTL" offset="0xE8" width="16" description="">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP3LOCK" acronym="CONTROLSS_SDFM0_SDCOMP3LOCK" offset="0xEE" width="16" description="">
		<bitfield id="COMP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the SDCOMP3EVT1/2FLTTCTL and COMP3FILCLKCTL registers.    0  SDCOMP3EVT1/2FLTCTL and SDCOMP3EVT1/2FLTCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  SDCOMP3EVT1/2FLTCTL and SDCOMP3EVT1/2FLTCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="SDCOMP3CTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the SDCOMP3CTL register.    0  SDCOMP3CTL register is not locked. Write 0 to this bit has no effect.   1  SDCOMP3CTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="RW
	  			 SONCE"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP4CTL" acronym="CONTROLSS_SDFM0_SDCOMP4CTL" offset="0xF0" width="16" description="">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3 - 2" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM0_SDCOMP4EVT2FLTCTL" acronym="CONTROLSS_SDFM0_SDCOMP4EVT2FLTCTL" offset="0xF2" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
